# pandas

In [1]:
import pandas as pd

In [2]:
list=["a","b","c","d","e","f","g","h","i"]

In [3]:
#Series is an object to make series in pandas(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)
list_serie=pd.Series(data=list)

In [4]:
list_serie

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [5]:
car={"fooluks":"german","toyota":"japan","ford":"usa","saypa":"iran"}
s=pd.Series(car)
s

fooluks    german
toyota      japan
ford          usa
saypa        iran
dtype: object

# series attribute an methods

diffrence between attributes and methods (attributes don't need paranteses but methods need)

attribute

In [6]:
lst=[1,2,3,4,5,6,7,8,9]
s=pd.Series(lst)
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [7]:
s.values

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [8]:
s.index

RangeIndex(start=0, stop=9, step=1)

In [9]:
#o :object   int:number    float:decimal
s.dtype

dtype('int64')

methods

In [10]:
s.sum()

45

In [11]:
s.product()

362880

In [12]:
s.mean()

5.0

# parameter and argument

In [13]:
countries=["denmark","finland","norway","iceland","sweden"]
capitals=["copenhang","helsinki","oslo","reyjavik","stockholm"]

In [14]:
serie=pd.Series(data=countries , index=capitals)
serie

copenhang    denmark
helsinki     finland
oslo          norway
reyjavik     iceland
stockholm     sweden
dtype: object

In [15]:
#usecols for choosing the column and squeeze for changing it to be a serie
data=pd.read_csv("D:\\tala\\data science projects\\dr.fozouni\\jamesbond.csv" , usecols=["Film"] , squeeze=True)#index_col=["Film"]
data

C:\Users\Science Pillar\AppData\Local\Temp\ipykernel_9988\3486438417.py:2: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  data=pd.read_csv("D:\\tala\\data science projects\\dr.fozouni\\jamesbond.csv" , usecols=["Film"] , squeeze=True)#index_col=["Film"]

0                              Dr. No
1               From Russia with Love
2                          Goldfinger
3                         Thunderball
4                       Casino Royale
5                 You Only Live Twice
6     On Her Majesty's Secret Service
7                Diamonds Are Forever
8                    Live and Let Die
9         The Man with the Golden Gun
10               The Spy Who Loved Me
11                          Moonraker
12                 For Your Eyes Only
13              Never Say Never Again
14                          Octopussy
15                   A View to a Kill
16               The Living Daylights
17                    Licence to Kill
18                          GoldenEye
19                Tomorrow Never Dies
20            The World Is Not Enough
21                    Die Another Day
22                      Casino Royale
23                  Quantum of Solace
24                            Skyfall
25                            Spectre
Name: Film, dtype: object

In [16]:
data.is_unique

False

In [17]:
data.shape

(26,)

In [18]:
data.ndim

1

In [19]:
data.size

26

In [20]:
len(data)

26

# functions

In [21]:
##chain
# .sort_value() is  sorting our data
data.sort_values()# .sort_values(ascending=False)

15                   A View to a Kill
22                      Casino Royale
4                       Casino Royale
7                Diamonds Are Forever
21                    Die Another Day
0                              Dr. No
12                 For Your Eyes Only
1               From Russia with Love
18                          GoldenEye
2                          Goldfinger
17                    Licence to Kill
8                    Live and Let Die
11                          Moonraker
13              Never Say Never Again
14                          Octopussy
6     On Her Majesty's Secret Service
23                  Quantum of Solace
24                            Skyfall
25                            Spectre
16               The Living Daylights
9         The Man with the Golden Gun
10               The Spy Who Loved Me
20            The World Is Not Enough
3                         Thunderball
19                Tomorrow Never Dies
5                 You Only Live Twice
Name: Film, dtype: object

In [22]:
#data.sort_values(ascending= False , inplace=False) index is fixing
data.sort_values().head()

15        A View to a Kill
22           Casino Royale
4            Casino Royale
7     Diamonds Are Forever
21         Die Another Day
Name: Film, dtype: object

In [23]:
data.sort_index().head()

0                   Dr. No
1    From Russia with Love
2               Goldfinger
3              Thunderball
4            Casino Royale
Name: Film, dtype: object

In [24]:
# is "Goldfinger" in the indexes?
"Goldfinger" in data

False

In [25]:
# is "Goldfinger" in the values?
"Goldfinger" in data.values

True

In [26]:
#what is the value of the index numbe?
data[4]

'Casino Royale'

In [27]:
data[[2,4,7]]

2              Goldfinger
4           Casino Royale
7    Diamonds Are Forever
Name: Film, dtype: object

In [28]:
data[5:8]

5                You Only Live Twice
6    On Her Majesty's Secret Service
7               Diamonds Are Forever
Name: Film, dtype: object

In [29]:
data[-4:]

22        Casino Royale
23    Quantum of Solace
24              Skyfall
25              Spectre
Name: Film, dtype: object

In [30]:
#for forbiden of errors
data.get([100] , default="it isnt in data")

'it isnt in data'

In [31]:
# in count if we have null value it wont count then but in len it will count them too
data.count()

26

In [32]:
s.std()

2.7386127875258306

In [33]:
s.min()

1

In [34]:
s.max()

9

In [35]:
s.median()

5.0

In [36]:
s.describe()

count    9.000000
mean     5.000000
std      2.738613
min      1.000000
25%      3.000000
50%      5.000000
75%      7.000000
max      9.000000
dtype: float64

In [37]:
#minimum amount is in which index
s.idxmin()

0

In [38]:
s.idxmax()

8

In [39]:
#showing frequency in values
a=[1,2,3,1,2,4,5,6,3,4,8]
b=pd.Series(a)
b.value_counts()

1    2
2    2
3    2
4    2
5    1
6    1
8    1
dtype: int64

In [40]:
# apply method in functions
def satisfy(x):
    if x<=3:
        return "bad"
    elif x>4 and x<=6:
        return "normal"
    else:
        return "good"

In [41]:
b.apply(satisfy)

0        bad
1        bad
2        bad
3        bad
4        bad
5       good
6     normal
7     normal
8        bad
9       good
10      good
dtype: object

In [42]:
b.apply(lambda x:x+1)

0     2
1     3
2     4
3     2
4     3
5     5
6     6
7     7
8     4
9     5
10    9
dtype: int64

# dataframes

In [43]:
df=pd.read_csv("D:\\tala\\data science projects\\dr.fozouni\\jamesbond.csv")
df

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN
10,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN
11,Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
12,For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
13,Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
14,Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
17,Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
18,GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
19,Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
21,Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
22,Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
23,Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN

In [44]:
df.index

RangeIndex(start=0, stop=26, step=1)

In [45]:
df.values

array([['Dr. No', 1962, 'Sean Connery', 'Terence Young', 448.8, 7.0, 0.6],
       ['From Russia with Love', 1963, 'Sean Connery', 'Terence Young',
        543.8, 12.6, 1.6],
       ['Goldfinger', 1964, 'Sean Connery', 'Guy Hamilton', 820.4, 18.6,
        3.2],
       ['Thunderball', 1965, 'Sean Connery', 'Terence Young', 848.1,
        41.9, 4.7],
       ['Casino Royale', 1967, 'David Niven', 'Ken Hughes', 315.0, 85.0,
        nan],
       ['You Only Live Twice', 1967, 'Sean Connery', 'Lewis Gilbert',
        514.2, 59.9, 4.4],
       ["On Her Majesty's Secret Service", 1969, 'George Lazenby',
        'Peter R. Hunt', 291.5, 37.3, 0.6],
       ['Diamonds Are Forever', 1971, 'Sean Connery', 'Guy Hamilton',
        442.5, 34.7, 5.8],
       ['Live and Let Die', 1973, 'Roger Moore', 'Guy Hamilton', 460.3,
        30.8, nan],
       ['The Man with the Golden Gun', 1974, 'Roger Moore',
        'Guy Hamilton', 334.0, 27.7, nan],
       ['The Spy Who Loved Me', 1977, 'Roger Moore', 'Lewis Gilbert',
        533.0, 45.1, nan],
       ['Moonraker', 1979, 'Roger Moore', 'Lewis Gilbert', 535.0, 91.5,
        nan],
       ['For Your Eyes Only', 1981, 'Roger Moore', 'John Glen', 449.4,
        60.2, nan],
       ['Never Say Never Again', 1983, 'Sean Connery', 'Irvin Kershner',
        380.0, 86.0, nan],
       ['Octopussy', 1983, 'Roger Moore', 'John Glen', 373.8, 53.9, 7.8],
       ['A View to a Kill', 1985, 'Roger Moore', 'John Glen', 275.2,
        54.5, 9.1],
       ['The Living Daylights', 1987, 'Timothy Dalton', 'John Glen',
        313.5, 68.8, 5.2],
       ['Licence to Kill', 1989, 'Timothy Dalton', 'John Glen', 250.9,
        56.7, 7.9],
       ['GoldenEye', 1995, 'Pierce Brosnan', 'Martin Campbell', 518.5,
        76.9, 5.1],
       ['Tomorrow Never Dies', 1997, 'Pierce Brosnan',
        'Roger Spottiswoode', 463.2, 133.9, 10.0],
       ['The World Is Not Enough', 1999, 'Pierce Brosnan',
        'Michael Apted', 439.5, 158.3, 13.5],
       ['Die Another Day', 2002, 'Pierce Brosnan', 'Lee Tamahori', 465.4,
        154.2, 17.9],
       ['Casino Royale', 2006, 'Daniel Craig', 'Martin Campbell', 581.5,
        145.3, 3.3],
       ['Quantum of Solace', 2008, 'Daniel Craig', 'Marc Forster', 514.2,
        181.4, 8.1],
       ['Skyfall', 2012, 'Daniel Craig', 'Sam Mendes', 943.5, 170.2,
        14.5],
       ['Spectre', 2015, 'Daniel Craig', 'Sam Mendes', 726.7, 206.3, nan]],
      dtype=object)

In [46]:
df.shape

(26, 7)

In [47]:
df.dtypes

Film                  object
Year                   int64
Actor                 object
Director              object
Box Office           float64
Budget               float64
Bond Actor Salary    float64
dtype: object

In [48]:
df.head(1)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6

In [49]:
df.dtypes.value_counts()

object     3
float64    3
int64      1
dtype: int64

In [50]:
df.columns

Index(['Film', 'Year', 'Actor', 'Director', 'Box Office', 'Budget',
       'Bond Actor Salary'],
      dtype='object')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Film               26 non-null     object
 1   Year               26 non-null     int64
 2   Actor              26 non-null     object
 3   Director           26 non-null     object
 4   Box Office         26 non-null     float64
 5   Budget             26 non-null     float64
 6   Bond Actor Salary  18 non-null     float64
dtypes: float64(3), int64(1), object(3)
memory usage: 1.5+ KB

In [52]:
#select one column
#df["Year"]
df.Year.head()

0    1962
1    1963
2    1964
3    1965
4    1967
Name: Year, dtype: int64

In [53]:
df[["Year" ,"Actor"]].head()

   Year         Actor
0  1962  Sean Connery
1  1963  Sean Connery
2  1964  Sean Connery
3  1965  Sean Connery
4  1967   David Niven

In [54]:
#reorder you dataframe 
new_column=["Film","Actor","Year"]
df[new_column].head()

                    Film         Actor  Year
0                 Dr. No  Sean Connery  1962
1  From Russia with Love  Sean Connery  1963
2             Goldfinger  Sean Connery  1964
3            Thunderball  Sean Connery  1965
4          Casino Royale   David Niven  1967

In [55]:
df["Bond Actor Salary"].min()

0.6

In [56]:
df["Bond Actor Salary"].max()

17.9

In [57]:
df["Bond Actor Salary"].round()

0      1.0
1      2.0
2      3.0
3      5.0
4      NaN
5      4.0
6      1.0
7      6.0
8      NaN
9      NaN
10     NaN
11     NaN
12     NaN
13     NaN
14     8.0
15     9.0
16     5.0
17     8.0
18     5.0
19    10.0
20    14.0
21    18.0
22     3.0
23     8.0
24    14.0
25     NaN
Name: Bond Actor Salary, dtype: float64

In [58]:
# adding column in middle of dataframe
df.insert(3 , column="hello" , value="good") #index=3 , name , value
df.head()

,Film,Year,Actor,hello,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,good,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,good,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,good,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,good,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,good,Ken Hughes,315.0,85.0,NaN

In [59]:
#add() we add all amounts of column 
df["Budget"].add(2)
#df["Budget"]+2

0       9.0
1      14.6
2      20.6
3      43.9
4      87.0
5      61.9
6      39.3
7      36.7
8      32.8
9      29.7
10     47.1
11     93.5
12     62.2
13     88.0
14     55.9
15     56.5
16     70.8
17     58.7
18     78.9
19    135.9
20    160.3
21    156.2
22    147.3
23    183.4
24    172.2
25    208.3
Name: Budget, dtype: float64

In [60]:
#we decrease unit each amounts of column
df["Budget"].sub(2)
#df["Budget"]-2

0       5.0
1      10.6
2      16.6
3      39.9
4      83.0
5      57.9
6      35.3
7      32.7
8      28.8
9      25.7
10     43.1
11     89.5
12     58.2
13     84.0
14     51.9
15     52.5
16     66.8
17     54.7
18     74.9
19    131.9
20    156.3
21    152.2
22    143.3
23    179.4
24    168.2
25    204.3
Name: Budget, dtype: float64

In [61]:
# multiply all amounts of column
df["Budget"].mul(2)
#df["Budget"]*2

0      14.0
1      25.2
2      37.2
3      83.8
4     170.0
5     119.8
6      74.6
7      69.4
8      61.6
9      55.4
10     90.2
11    183.0
12    120.4
13    172.0
14    107.8
15    109.0
16    137.6
17    113.4
18    153.8
19    267.8
20    316.6
21    308.4
22    290.6
23    362.8
24    340.4
25    412.6
Name: Budget, dtype: float64

In [62]:
#diviging each value of column
df["Budget"].div(2)
#df["Budget"]/2

0       3.50
1       6.30
2       9.30
3      20.95
4      42.50
5      29.95
6      18.65
7      17.35
8      15.40
9      13.85
10     22.55
11     45.75
12     30.10
13     43.00
14     26.95
15     27.25
16     34.40
17     28.35
18     38.45
19     66.95
20     79.15
21     77.10
22     72.65
23     90.70
24     85.10
25    103.15
Name: Budget, dtype: float64

# dealing with null values

In [63]:
#droping the rows which had null values
df.dropna() #df.dropna(how="all") if all of values in row be null and inplace have to be True (defailt axis=0)
#df.dropna(how="any" , subset=["Year"]) deleting rows wich null values are in year columns

,Film,Year,Actor,hello,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,good,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,good,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,good,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,good,Terence Young,848.1,41.9,4.7
5,You Only Live Twice,1967,Sean Connery,good,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,good,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sean Connery,good,Guy Hamilton,442.5,34.7,5.8
14,Octopussy,1983,Roger Moore,good,John Glen,373.8,53.9,7.8
15,A View to a Kill,1985,Roger Moore,good,John Glen,275.2,54.5,9.1
16,The Living Daylights,1987,Timothy Dalton,good,John Glen,313.5,68.8,5.2
17,Licence to Kill,1989,Timothy Dalton,good,John Glen,250.9,56.7,7.9
18,GoldenEye,1995,Pierce Brosnan,good,Martin Campbell,518.5,76.9,5.1
19,Tomorrow Never Dies,1997,Pierce Brosnan,good,Roger Spottiswoode,463.2,133.9,10.0
20,The World Is Not Enough,1999,Pierce Brosnan,good,Michael Apted,439.5,158.3,13.5
21,Die Another Day,2002,Pierce Brosnan,good,Lee Tamahori,465.4,154.2,17.9
22,Casino Royale,2006,Daniel Craig,good,Martin Campbell,581.5,145.3,3.3
23,Quantum of Solace,2008,Daniel Craig,good,Marc Forster,514.2,181.4,8.1
24,Skyfall,2012,Daniel Craig,good,Sam Mendes,943.5,170.2,14.5

In [64]:
#filling the null values
#df.fillna(value=) if you see null  , fill it 0

In [65]:
#we onlu fill the null value of director  column with 0
df["Director"].fillna(0 , inplace=True)

In [66]:
df["Bond Actor Salary"].isnull().sum()

8

In [67]:
df["Bond Actor Salary"].mean()

6.85

In [68]:
df["Bond Actor Salary"].fillna(6.8 , inplace=True)

In [69]:
#changing the types of columns
df["Bond Actor Salary"]=df["Bond Actor Salary"].astype("int")

In [70]:
df["Bond Actor Salary"].dtype

dtype('int32')

In [71]:
df["Actor"].dtype

dtype('O')

In [72]:
df["Actor"].unique()

array(['Sean Connery', 'David Niven', 'George Lazenby', 'Roger Moore',
       'Timothy Dalton', 'Pierce Brosnan', 'Daniel Craig'], dtype=object)

In [73]:
df["Actor"]=df["Actor"].astype("category" )

In [74]:
df["Actor"].dtype

CategoricalDtype(categories=['Daniel Craig', 'David Niven', 'George Lazenby',
                  'Pierce Brosnan', 'Roger Moore', 'Sean Connery',
                  'Timothy Dalton'],
, ordered=False)

In [75]:
df.head()

,Film,Year,Actor,hello,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,good,Terence Young,448.8,7.0,0
1,From Russia with Love,1963,Sean Connery,good,Terence Young,543.8,12.6,1
2,Goldfinger,1964,Sean Connery,good,Guy Hamilton,820.4,18.6,3
3,Thunderball,1965,Sean Connery,good,Terence Young,848.1,41.9,4
4,Casino Royale,1967,David Niven,good,Ken Hughes,315.0,85.0,6

# sort values()

In [76]:
#df.sort_values("Box Office" , ascending=True , inplace=True , na_position= True)# na_position :the null value position
df.head()

,Film,Year,Actor,hello,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,good,Terence Young,448.8,7.0,0
1,From Russia with Love,1963,Sean Connery,good,Terence Young,543.8,12.6,1
2,Goldfinger,1964,Sean Connery,good,Guy Hamilton,820.4,18.6,3
3,Thunderball,1965,Sean Connery,good,Terence Young,848.1,41.9,4
4,Casino Royale,1967,David Niven,good,Ken Hughes,315.0,85.0,6

In [77]:
df.sort_values(["hello" , "Director"] , ascending=[True , False])# first proirity is hello then director

,Film,Year,Actor,hello,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,good,Terence Young,448.8,7.0,0
1,From Russia with Love,1963,Sean Connery,good,Terence Young,543.8,12.6,1
3,Thunderball,1965,Sean Connery,good,Terence Young,848.1,41.9,4
24,Skyfall,2012,Daniel Craig,good,Sam Mendes,943.5,170.2,14
25,Spectre,2015,Daniel Craig,good,Sam Mendes,726.7,206.3,6
19,Tomorrow Never Dies,1997,Pierce Brosnan,good,Roger Spottiswoode,463.2,133.9,10
6,On Her Majesty's Secret Service,1969,George Lazenby,good,Peter R. Hunt,291.5,37.3,0
20,The World Is Not Enough,1999,Pierce Brosnan,good,Michael Apted,439.5,158.3,13
18,GoldenEye,1995,Pierce Brosnan,good,Martin Campbell,518.5,76.9,5
22,Casino Royale,2006,Daniel Craig,good,Martin Campbell,581.5,145.3,3
23,Quantum of Solace,2008,Daniel Craig,good,Marc Forster,514.2,181.4,8
5,You Only Live Twice,1967,Sean Connery,good,Lewis Gilbert,514.2,59.9,4
10,The Spy Who Loved Me,1977,Roger Moore,good,Lewis Gilbert,533.0,45.1,6
11,Moonraker,1979,Roger Moore,good,Lewis Gilbert,535.0,91.5,6
21,Die Another Day,2002,Pierce Brosnan,good,Lee Tamahori,465.4,154.2,17
4,Casino Royale,1967,David Niven,good,Ken Hughes,315.0,85.0,6
12,For Your Eyes Only,1981,Roger Moore,good,John Glen,449.4,60.2,6
14,Octopussy,1983,Roger Moore,good,John Glen,373.8,53.9,7
15,A View to a Kill,1985,Roger Moore,good,John Glen,275.2,54.5,9
16,The Living Daylights,1987,Timothy Dalton,good,John Glen,313.5,68.8,5
17,Licence to Kill,1989,Timothy Dalton,good,John Glen,250.9,56.7,7
13,Never Say Never Again,1983,Sean Connery,good,Irvin Kershner,380.0,86.0,6
2,Goldfinger,1964,Sean Connery,good,Guy Hamilton,820.4,18.6,3
7,Diamonds Are Forever,1971,Sean Connery,good,Guy Hamilton,442.5,34.7,5
8,Live and Let Die,1973,Roger Moore,good,Guy Hamilton,460.3,30.8,6
9,The Man with the Golden Gun,1974,Roger Moore,good,Guy Hamilton,334.0,27.7,6

# ranking

In [78]:
df["Budget"].rank(ascending=False)

0     26.0
1     25.0
2     24.0
3     19.0
4     10.0
5     14.0
6     20.0
7     21.0
8     22.0
9     23.0
10    18.0
11     8.0
12    13.0
13     9.0
14    17.0
15    16.0
16    12.0
17    15.0
18    11.0
19     7.0
20     4.0
21     5.0
22     6.0
23     2.0
24     3.0
25     1.0
Name: Budget, dtype: float64

In [79]:
import pandas as pd

In [80]:
#we can change the type of data when we want to load the dataset
#raw_data=pd.read_csv("D:\\tala\\pandas\\employees.csv" , parse_dates=["Start Date" , "Last Login Time"])
raw_data=pd.read_csv("D:\\tala\\pandas\\employees.csv")
raw_data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [81]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

# changing the type to datatime

In [82]:
raw_data["Start Date"]=pd.to_datetime(raw_data["Start Date"])

In [83]:
raw_data["Last Login Time"]=pd.to_datetime(raw_data["Last Login Time"])

In [84]:
raw_data.tail(30)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
970,Alice,Female,1988-09-03,2022-11-30 20:54:00,63571,15.397,True,Product
971,Patrick,Male,2002-12-30,2022-11-30 02:01:00,75423,5.368,True,Business Development
972,Victor,NaN,2006-07-28,2022-11-30 14:49:00,76381,11.159,True,Sales
973,Russell,Male,2013-05-10,2022-11-30 23:08:00,137359,11.105,False,Business Development
974,Harry,Male,2011-08-30,2022-11-30 18:31:00,67656,16.455,True,Client Services
975,Susan,Female,1995-04-07,2022-11-30 22:05:00,92436,12.467,False,Sales
976,Denise,Female,1992-10-19,2022-11-30 05:42:00,137954,4.195,True,Legal
977,Sarah,Female,1995-12-04,2022-11-30 09:16:00,124566,5.949,False,Product
978,Sean,Male,1983-01-17,2022-11-30 14:23:00,66146,11.178,False,Human Resources
979,Ernest,Male,2013-07-20,2022-11-30 06:41:00,142935,13.198,True,Product
980,Kimberly,Female,2013-01-26,2022-11-30 00:57:00,46233,8.862,True,Engineering
981,James,Male,1993-01-15,2022-11-30 17:19:00,148985,19.280,False,Legal
982,Rose,Female,1982-04-06,2022-11-30 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2022-11-30 22:35:00,146907,11.738,False,Engineering
984,Maria,Female,2011-10-15,2022-11-30 16:53:00,43455,13.040,False,Engineering
985,Stephen,NaN,1983-07-10,2022-11-30 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2022-11-30 07:04:00,82871,17.999,False,Marketing
987,Gloria,Female,2014-12-08,2022-11-30 05:08:00,136709,10.331,True,Finance
988,Alice,Female,2004-10-05,2022-11-30 09:34:00,47638,11.209,False,Human Resources
989,Justin,NaN,1991-02-10,2022-11-30 16:58:00,38344,3.794,False,Legal
990,Robin,Female,1987-07-24,2022-11-30 13:35:00,100765,10.982,True,Client Services
991,Rose,Female,2002-08-25,2022-11-30 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-11-30 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-11-30 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-11-30 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-30 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-11-30 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-11-30 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-30 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-30 18:24:00,129949,10.169,True,Sales

In [85]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 62.6+ KB

# bool is using for only True and False and change all things to be True or False even change the nulls too

# categort only change the type and dont change null values

In [86]:
raw_data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2022-11-30 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-11-30 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-11-30 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-30 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-30 18:24:00,129949,10.169,True,Sales

In [87]:
raw_data["Senior Management"]=raw_data["Senior Management"].astype("bool")
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [88]:
raw_data["Gender"]=raw_data["Gender"].astype("category")
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

In [89]:
raw_data["Team"]=raw_data["Team"].astype("category")
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int64(1), object(1)
memory usage: 42.6+ KB

In [90]:
raw_data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services

# extracting data from dataframe(filter)

making mask

In [91]:
#if we put only one equal all of columns changes to be female
raw_data["Gender"]=="Female"

0      False
1      False
2       True
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Gender, Length: 1000, dtype: bool

In [92]:
# new dataframe that all of the are female (filtering)
raw_data[raw_data["Gender"]=="Female"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
6,Ruby,Female,1987-08-17,2022-11-30 16:20:00,65476,10.012,True,Product
7,NaN,Female,2015-07-20,2022-11-30 10:43:00,45906,11.598,True,Finance
8,Angela,Female,2005-11-22,2022-11-30 06:29:00,95570,18.523,True,Engineering
9,Frances,Female,2002-08-08,2022-11-30 06:51:00,139852,7.524,True,Business Development
...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2022-11-30 05:08:00,136709,10.331,True,Finance
988,Alice,Female,2004-10-05,2022-11-30 09:34:00,47638,11.209,False,Human Resources
990,Robin,Female,1987-07-24,2022-11-30 13:35:00,100765,10.982,True,Client Services
991,Rose,Female,2002-08-25,2022-11-30 05:12:00,134505,11.051,True,Marketing
993,Tina,Female,1997-05-15,2022-11-30 15:53:00,56450,19.040,True,Engineering

In [93]:
mask=raw_data["Team"]=="Legal"
raw_data[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2022-11-30 01:35:00,115163,10.125,False,Legal
11,Julie,Female,1997-10-26,2022-11-30 15:19:00,102508,12.637,True,Legal
20,Lois,NaN,1995-04-22,2022-11-30 19:18:00,64714,4.934,True,Legal
27,Scott,NaN,1991-07-11,2022-11-30 18:58:00,122367,5.218,False,Legal
29,Benjamin,Male,2005-01-26,2022-11-30 22:06:00,79529,7.008,True,Legal
...,...,...,...,...,...,...,...,...
961,Antonio,NaN,1989-06-18,2022-11-30 21:37:00,103050,3.050,False,Legal
976,Denise,Female,1992-10-19,2022-11-30 05:42:00,137954,4.195,True,Legal
981,James,Male,1993-01-15,2022-11-30 17:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,2022-11-30 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2022-11-30 16:58:00,38344,3.794,False,Legal

In [94]:
mask_1=raw_data["Team"]!="Finance"
raw_data[mask_1]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-11-30 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2022-11-30 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-11-30 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-30 06:09:00,132483,16.655,False,Distribution
997,Russell,Male,2013-05-20,2022-11-30 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-30 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-30 18:24:00,129949,10.169,True,Sales

In [95]:
mask_2=raw_data["Salary"]>100000
raw_data[mask_2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-11-30 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2022-11-30 06:51:00,139852,7.524,True,Business Development
...,...,...,...,...,...,...,...,...
990,Robin,Female,1987-07-24,2022-11-30 13:35:00,100765,10.982,True,Client Services
991,Rose,Female,2002-08-25,2022-11-30 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-11-30 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2022-11-30 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2022-11-30 18:24:00,129949,10.169,True,Sales

# filter(and)

In [96]:
mask_3=raw_data["Start Date"]>"2014-01-01"
musk_4=raw_data["Salary"]<100000
raw_data[mask_3 & musk_4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
7,NaN,Female,2015-07-20,2022-11-30 10:43:00,45906,11.598,True,Finance
15,Lillian,Female,2016-06-05,2022-11-30 06:09:00,59414,1.256,False,Product
41,Christine,NaN,2015-06-28,2022-11-30 01:08:00,66582,11.308,True,Business Development
53,Alan,NaN,2014-03-03,2022-11-30 13:28:00,40341,17.578,True,Finance
89,Janice,Female,2016-03-12,2022-11-30 00:40:00,51082,11.955,False,Legal
149,NaN,Female,2014-08-17,2022-11-30 14:00:00,86230,8.578,True,Distribution
165,NaN,Female,2014-03-23,2022-11-30 13:28:00,59148,9.061,True,Legal
225,Harry,Male,2015-10-01,2022-11-30 19:47:00,64579,15.266,True,Sales
235,Norma,Female,2015-02-11,2022-11-30 23:44:00,94393,3.643,True,Engineering
239,Lillian,NaN,2016-05-12,2022-11-30 15:43:00,64164,17.612,False,Human Resources
301,James,Male,2015-07-11,2022-11-30 20:52:00,72257,13.023,False,Engineering
335,Robert,Male,2014-11-18,2022-11-30 05:00:00,85799,19.930,False,Finance
361,Margaret,Female,2014-05-05,2022-11-30 06:01:00,55044,4.078,False,Sales
405,Sharon,Female,2014-03-09,2022-11-30 16:39:00,91522,7.564,False,Finance
444,NaN,Male,2016-05-24,2022-11-30 21:17:00,76409,7.008,True,Distribution
487,Cheryl,Female,2014-12-03,2022-11-30 09:27:00,71751,15.918,False,Business Development
496,Johnny,Male,2016-02-26,2022-11-30 19:39:00,76394,5.437,True,Marketing
504,NaN,Female,2014-06-24,2022-11-30 10:05:00,38275,10.494,True,Distribution
529,Christopher,Male,2014-04-23,2022-11-30 07:52:00,82401,7.252,False,Client Services
530,Kathleen,Female,2014-06-13,2022-11-30 09:16:00,35575,14.595,False,Distribution
533,Earl,Male,2014-02-11,2022-11-30 21:03:00,52620,13.773,False,Product
556,Arthur,Male,2014-12-16,2022-11-30 16:56:00,66819,6.639,True,Marketing
625,Cynthia,Female,2015-06-29,2022-11-30 06:38:00,82408,8.701,True,Marketing
711,Karen,Female,2014-01-09,2022-11-30 22:09:00,46478,16.552,False,Engineering
726,Daniel,Male,2016-02-29,2022-11-30 04:04:00,77287,13.000,True,NaN
742,Martin,Male,2016-02-25,2022-11-30 18:29:00,61117,2.844,False,Client Services
824,Julia,Female,2014-08-18,2022-11-30 03:12:00,97566,2.147,False,Marketing
827,Jesse,NaN,2014-07-16,2022-11-30 02:24:00,98811,7.487,False,Legal
831,Kenneth,Male,2015-01-15,2022-11-30 14:41:00,69112,7.588,True,Finance
872,Brenda,Female,2015-01-18,2022-11-30 16:39:00,73749,19.332,False,Business Development
886,Anthony,Male,2014-01-30,2022-11-30 21:04:00,96795,14.837,False,Sales
906,Frances,Female,2014-05-16,2022-11-30 08:31:00,35884,17.667,False,Sales
913,Lois,Female,2015-12-11,2022-11-30 16:10:00,99747,6.168,False,Marketing
921,George,Male,2015-06-05,2022-11-30 05:40:00,50369,18.900,True,Sales
942,Lori,Female,2015-11-20,2022-11-30 13:15:00,75498,6.537,True,Marketing

# filter (or)

In [97]:
mask_3=raw_data["Start Date"]>"2014-01-01"
musk_4=raw_data["Salary"]<100000
raw_data[mask_3 | musk_4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2022-11-30 16:20:00,65476,10.012,True,Product
7,NaN,Female,2015-07-20,2022-11-30 10:43:00,45906,11.598,True,Finance
8,Angela,Female,2005-11-22,2022-11-30 06:29:00,95570,18.523,True,Engineering
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-11-30 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-30 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-11-30 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-11-30 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-11-30 16:45:00,60500,11.985,False,Business Development

In [98]:
mask_3=raw_data["Start Date"]>"2015-01-01"
mask_5=raw_data["Team"]=="Business Development"
mask_5=raw_data["Senior Management"]==True
raw_data[(mask_3&mask_5) | mask_5]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2022-11-30 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2022-11-30 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-11-30 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-11-30 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-11-30 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2022-11-30 18:24:00,129949,10.169,True,Sales

In [99]:
raw_data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services

In [100]:
# mask=raw_data["Team"].isin(["Finance" ,"Marketing" , "Client Services"])
#raw_data[mask]
mask_1=raw_data["Team"]=="Finance"
mask_2=raw_data["Team"]=="Marketing"
mask_3=raw_data["Team"]=="Client Services"
raw_data[mask_1 |mask_2 |mask_3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services
7,NaN,Female,2015-07-20,2022-11-30 10:43:00,45906,11.598,True,Finance
...,...,...,...,...,...,...,...,...
990,Robin,Female,1987-07-24,2022-11-30 13:35:00,100765,10.982,True,Client Services
991,Rose,Female,2002-08-25,2022-11-30 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-11-30 08:35:00,112769,11.625,True,Finance
994,George,Male,2013-06-21,2022-11-30 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-11-30 06:30:00,42392,19.675,False,Finance

In [101]:
# raw_data["Team"].notnull().sum()
raw_data["Team"].isnull().sum()
#mask=raw_data["Team"].isnull()
#raw_data[mask]

43

In [102]:
mask=raw_data["Salary"].between(42000,60000)
raw_data[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
7,NaN,Female,2015-07-20,2022-11-30 10:43:00,45906,11.598,True,Finance
15,Lillian,Female,2016-06-05,2022-11-30 06:09:00,59414,1.256,False,Product
37,Linda,Female,1981-10-19,2022-11-30 20:49:00,57427,9.557,True,Client Services
52,Todd,Male,1990-02-18,2022-11-30 02:41:00,49339,1.695,True,Human Resources
60,Paula,NaN,2005-11-23,2022-11-30 14:01:00,48866,4.271,False,Distribution
...,...,...,...,...,...,...,...,...
980,Kimberly,Female,2013-01-26,2022-11-30 00:57:00,46233,8.862,True,Engineering
984,Maria,Female,2011-10-15,2022-11-30 16:53:00,43455,13.040,False,Engineering
988,Alice,Female,2004-10-05,2022-11-30 09:34:00,47638,11.209,False,Human Resources
993,Tina,Female,1997-05-15,2022-11-30 15:53:00,56450,19.040,True,Engineering
996,Phillip,Male,1984-01-31,2022-11-30 06:30:00,42392,19.675,False,Finance

# duplicate

In [103]:
#default keep="first"  it is keeping first one as true the false as frequency of then
raw_data["First Name"].duplicated()#( keep="last" keeping only last one as true) or (keep=False  all the reapited ones)
#raw_data[raw_data["First Name"].duplicated()]
#raw_data[~raw_data["First Name"].duplicated()]

0      False
1      False
2      False
3      False
4      False
       ...
995     True
996     True
997     True
998     True
999     True
Name: First Name, Length: 1000, dtype: bool

# .drop_duplicates()

In [104]:
len(raw_data)

1000

In [105]:
#for droping thr rows that all values in whole cell be the same
len(raw_data.drop_duplicates())

1000

In [106]:
raw_data.drop_duplicates(subset=["First Name" , "Team"] , keep="first") #kepp="last" or keep=False

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-11-30 17:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,2022-11-30 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-11-30 06:30:00,42392,19.675,False,Finance
998,Larry,Male,2013-04-20,2022-11-30 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-11-30 18:24:00,129949,10.169,True,Sales

# unique() and nunique()

In [107]:
raw_data["Gender"].unique()

['Male', 'Female', NaN]
Categories (2, object): ['Female', 'Male']

In [108]:
#nunique dont counts nulls
raw_data["Gender"].nunique()

2

In [109]:
#dropna=False means count nulls too
raw_data["Gender"].nunique(dropna=False)

3

In [110]:
df.head()

,Film,Year,Actor,hello,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,good,Terence Young,448.8,7.0,0
1,From Russia with Love,1963,Sean Connery,good,Terence Young,543.8,12.6,1
2,Goldfinger,1964,Sean Connery,good,Guy Hamilton,820.4,18.6,3
3,Thunderball,1965,Sean Connery,good,Terence Young,848.1,41.9,4
4,Casino Royale,1967,David Niven,good,Ken Hughes,315.0,85.0,6

In [111]:
df=df.drop(["hello"], axis=1)

In [112]:
df

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,6
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,6
10,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,6
11,Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,6
12,For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,6
13,Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,6
14,Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5
17,Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7
18,GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5
19,Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13
21,Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
22,Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
23,Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,6

# dealing with index

In [113]:
#df=pd.read_csv("" , index_col="Film")
df.set_index(keys="Film" , inplace=True )

In [114]:
df.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6

# reset the index

In [115]:
df.reset_index() #(drop=True deleting the last index(film)) default is False

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,6
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,6
10,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,6
11,Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,6
12,For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,6
13,Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,6
14,Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5
17,Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7
18,GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5
19,Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13
21,Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
22,Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
23,Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,6

In [116]:
df.reset_index()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,6
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,6
10,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,6
11,Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,6
12,For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,6
13,Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,6
14,Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5
17,Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7
18,GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5
19,Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13
21,Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
22,Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
23,Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,6

In [117]:
df.sort_index(inplace=True)
df.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17

# finding amount of cells

loc , iloc

In [118]:
df.loc["A View to a Kill"]

Year                        1985
Actor                Roger Moore
Director               John Glen
Box Office                 275.2
Budget                      54.5
Bond Actor Salary              9
Name: A View to a Kill, dtype: object

In [119]:
df.loc["Casino Royale"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6

In [120]:
#slice(df.loc["statring" : "stoping" : step])
df.loc["A View to a Kil" :"Die Another Day" : 2]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17

In [121]:
df.loc[["A View to a Kill" ,"Die Another Day" ]]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17

# finding index of one film

In [122]:
 "Die Another Day"  in df.index

True

# finding by index

In [123]:
df.iloc[2]

Year                        1967
Actor                David Niven
Director              Ken Hughes
Box Office                 315.0
Budget                      85.0
Bond Actor Salary              6
Name: Casino Royale, dtype: object

In [124]:
#df.iloc[starting:finishing:step]
df.iloc[2:10:2]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5

In [125]:
#df.loc["Die Another Day" ,["Director" , "Budget"]] I only wany director and budget of that film
df.loc[["Die Another Day","GoldenEye"] ,["Director", "Budget"]]

                        Director  Budget
Film
Die Another Day     Lee Tamahori   154.2
GoldenEye        Martin Campbell    76.9

In [126]:
df.iloc[[1,4] ,[1,3]]

                          Actor  Box Office
Film
Casino Royale      Daniel Craig       581.5
Die Another Day  Pierce Brosnan       465.4

In [127]:
df.iloc[1:4 ,1:3]

                             Actor         Director
Film
Casino Royale         Daniel Craig  Martin Campbell
Casino Royale          David Niven       Ken Hughes
Diamonds Are Forever  Sean Connery     Guy Hamilton

In [128]:
df.loc["Casino Royale" :"GoldenEye" ,"Year" :"Box Office"]

                       Year           Actor         Director  Box Office
Film
Casino Royale          2006    Daniel Craig  Martin Campbell       581.5
Casino Royale          1967     David Niven       Ken Hughes       315.0
Diamonds Are Forever   1971    Sean Connery     Guy Hamilton       442.5
Die Another Day        2002  Pierce Brosnan     Lee Tamahori       465.4
Dr. No                 1962    Sean Connery    Terence Young       448.8
For Your Eyes Only     1981     Roger Moore        John Glen       449.4
From Russia with Love  1963    Sean Connery    Terence Young       543.8
GoldenEye              1995  Pierce Brosnan  Martin Campbell       518.5

# changind one  cell of data

In [129]:
df.loc["Dr. No" ,"Director"]

'Terence Young'

In [130]:
df.loc["Dr. No" ,"Director"]="Tahereh Hassanzadeh"

In [131]:
df.loc["Dr. No" ,"Director"]

'Tahereh Hassanzadeh'

In [132]:
df.head(7)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
Dr. No,1962,Sean Connery,Tahereh Hassanzadeh,448.8,7.0,0
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,6

In [133]:
df.loc["For Your Eyes Only" ,["Director" , "Box Office" ,"Budget"]]=["Deniz" , 1000 , 100]

In [134]:
df.loc["For Your Eyes Only"]

Year                        1981
Actor                Roger Moore
Director                   Deniz
Box Office                1000.0
Budget                     100.0
Bond Actor Salary              6
Name: For Your Eyes Only, dtype: object

In [135]:
df.head(10)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
Dr. No,1962,Sean Connery,Tahereh Hassanzadeh,448.8,7.0,0
For Your Eyes Only,1981,Roger Moore,Deniz,1000.0,100.0,6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3

In [137]:
bond=df.copy()
bond.head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17

# rename

changing the index names

In [138]:
# if we want to change our datas we have to add inplace=True
#bond.rename(mapper={"A View to a Kill" : "A View to A Kill" ,"Diamonds Are Forever":"Diamonds "} , axis=0)
#bond.rename(mapper={"A View to a Kill" : "A View to A Kill" ,"Diamonds Are Forever":"Diamonds "} , axis="rows")
#bond.rename(mapper={"A View to a Kill" : "A View to A Kill" ,"Diamonds Are Forever":"Diamonds "} , axis="index")
#bond.rename(index={"A View to a Kill" : "A View to A Kill" ,"Diamonds Are Forever":"Diamonds "})
bond.rename(mapper={"A View to a Kill" : "A View to A Kill"})

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to A Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
Dr. No,1962,Sean Connery,Tahereh Hassanzadeh,448.8,7.0,0
For Your Eyes Only,1981,Roger Moore,Deniz,1000.0,100.0,6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,6
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,6
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,6
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,6
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5
The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,6
The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,6
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4

changing the column's name

In [140]:
#inplace =True  to change the data
#bond.rename(columns={"Year" : "release date" , "Box Office" : "revenue"}, inplace=True)
#bond.rename(mapper={"Year" : "release date" , "Box Office" : "revenue"} , axis="columns")
bond.rename(mapper={"Year" : "release date" , "Box Office" : "revenue"} , axis=1)

,release date,Actor,Director,revenue,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
Dr. No,1962,Sean Connery,Tahereh Hassanzadeh,448.8,7.0,0
For Your Eyes Only,1981,Roger Moore,Deniz,1000.0,100.0,6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,6
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,6
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,6
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,6
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5
The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,6
The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,6
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4

changing the name of columns

In [141]:
new_columns=["year" , "director" ,"actors" ,"box_office" ,"budget", "salary"]
bond.columns=new_columns

In [142]:
bond.head(1)

                  year     director     actors  box_office  budget  salary
Film
A View to a Kill  1985  Roger Moore  John Glen       275.2    54.5       9

# deleting rows and columns of dataframe

In [143]:
#droping the rows
bond.drop("A View to a Kill")#for delet from dataset we have to add inplace=True

,year,director,actors,box_office,budget,salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
Dr. No,1962,Sean Connery,Tahereh Hassanzadeh,448.8,7.0,0
For Your Eyes Only,1981,Roger Moore,Deniz,1000.0,100.0,6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,6
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,6
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,6
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,6
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5
The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,6
The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,6
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4

In [144]:
#dropping the columns 
#have to inplace = True
bond.drop(["year"] , axis=1)
#bond.pop(["year"])          dont need to inplace it drop column in original dataset

,director,actors,box_office,budget,salary
Film,,,,,
A View to a Kill,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,Pierce Brosnan,Lee Tamahori,465.4,154.2,17
Dr. No,Sean Connery,Tahereh Hassanzadeh,448.8,7.0,0
For Your Eyes Only,Roger Moore,Deniz,1000.0,100.0,6
From Russia with Love,Sean Connery,Terence Young,543.8,12.6,1
GoldenEye,Pierce Brosnan,Martin Campbell,518.5,76.9,5
Goldfinger,Sean Connery,Guy Hamilton,820.4,18.6,3
Licence to Kill,Timothy Dalton,John Glen,250.9,56.7,7
Live and Let Die,Roger Moore,Guy Hamilton,460.3,30.8,6
Moonraker,Roger Moore,Lewis Gilbert,535.0,91.5,6
Never Say Never Again,Sean Connery,Irvin Kershner,380.0,86.0,6
Octopussy,Roger Moore,John Glen,373.8,53.9,7
On Her Majesty's Secret Service,George Lazenby,Peter R. Hunt,291.5,37.3,0
Quantum of Solace,Daniel Craig,Marc Forster,514.2,181.4,8
Skyfall,Daniel Craig,Sam Mendes,943.5,170.2,14
Spectre,Daniel Craig,Sam Mendes,726.7,206.3,6
The Living Daylights,Timothy Dalton,John Glen,313.5,68.8,5
The Man with the Golden Gun,Roger Moore,Guy Hamilton,334.0,27.7,6
The Spy Who Loved Me,Roger Moore,Lewis Gilbert,533.0,45.1,6
The World Is Not Enough,Pierce Brosnan,Michael Apted,439.5,158.3,13
Thunderball,Sean Connery,Terence Young,848.1,41.9,4
Tomorrow Never Dies,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10
You Only Live Twice,Sean Connery,Lewis Gilbert,514.2,59.9,4

In [145]:
bond.head()

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17

In [146]:
#dont need inplace= True
#del bond["director"]

# sample

In [148]:
#randomly giving one of rows
#(n= how many sample)    ( frac=0.3   30 percent of samples)  (axis=1  give columns)
bond.sample(n=2)

,year,director,actors,box_office,budget,salary
Film,,,,,,
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5

# 3 top/ botton amont in columns

In [149]:
#3 top amonth in box_office
bond.sort_values("box_office" , ascending=False).head(3)

,year,director,actors,box_office,budget,salary
Film,,,,,,
For Your Eyes Only,1981,Roger Moore,Deniz,1000.0,100.0,6
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4

In [150]:
#by n largest function
bond.nlargest(n=3 , columns="box_office")

,year,director,actors,box_office,budget,salary
Film,,,,,,
For Your Eyes Only,1981,Roger Moore,Deniz,1000.0,100.0,6
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4

In [152]:
#by nsmallest function
bond.nsmallest(n=3 , columns="box_office")

,year,director,actors,box_office,budget,salary
Film,,,,,,
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0

In [153]:
bond["box_office"].nlargest(3)

Film
For Your Eyes Only    1000.0
Skyfall                943.5
Thunderball            848.1
Name: box_office, dtype: float64

In [157]:
mask=bond["director"]=="Sean Connery"
bond[mask]

,year,director,actors,box_office,budget,salary
Film,,,,,,
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5,34.7,5
Dr. No,1962,Sean Connery,Sam Mendes,448.8,7.0,0
From Russia with Love,1963,Sean Connery,Sam Mendes,543.8,12.6,1
Goldfinger,1964,Sean Connery,Sam Mendes,820.4,18.6,3
Never Say Never Again,1983,Sean Connery,Sam Mendes,380.0,86.0,6
Thunderball,1965,Sean Connery,Sam Mendes,848.1,41.9,4
You Only Live Twice,1967,Sean Connery,Sam Mendes,514.2,59.9,4

In [158]:
#wgere giving whole data and if it wasnt our condition it become nan
bond.where(mask)

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Diamonds Are Forever,1971.0,Sean Connery,Sam Mendes,442.5,34.7,5.0
Die Another Day,NaN,NaN,NaN,NaN,NaN,NaN
Dr. No,1962.0,Sean Connery,Sam Mendes,448.8,7.0,0.0
For Your Eyes Only,NaN,NaN,NaN,NaN,NaN,NaN
From Russia with Love,1963.0,Sean Connery,Sam Mendes,543.8,12.6,1.0
GoldenEye,NaN,NaN,NaN,NaN,NaN,NaN
Goldfinger,1964.0,Sean Connery,Sam Mendes,820.4,18.6,3.0
Licence to Kill,NaN,NaN,NaN,NaN,NaN,NaN
Live and Let Die,NaN,NaN,NaN,NaN,NaN,NaN
Moonraker,NaN,NaN,NaN,NaN,NaN,NaN
Never Say Never Again,1983.0,Sean Connery,Sam Mendes,380.0,86.0,6.0
Octopussy,NaN,NaN,NaN,NaN,NaN,NaN
On Her Majesty's Secret Service,NaN,NaN,NaN,NaN,NaN,NaN
Quantum of Solace,NaN,NaN,NaN,NaN,NaN,NaN
Skyfall,NaN,NaN,NaN,NaN,NaN,NaN
Spectre,NaN,NaN,NaN,NaN,NaN,NaN
The Living Daylights,NaN,NaN,NaN,NaN,NaN,NaN
The Man with the Golden Gun,NaN,NaN,NaN,NaN,NaN,NaN
The Spy Who Loved Me,NaN,NaN,NaN,NaN,NaN,NaN
The World Is Not Enough,NaN,NaN,NaN,NaN,NaN,NaN
Thunderball,1965.0,Sean Connery,Sam Mendes,848.1,41.9,4.0
Tomorrow Never Dies,NaN,NaN,NaN,NaN,NaN,NaN
You Only Live Twice,1967.0,Sean Connery,Sam Mendes,514.2,59.9,4.0

In [159]:
bond.head()

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Sam Mendes,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Sam Mendes,581.5,145.3,3
Casino Royale,1967,David Niven,Sam Mendes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Sam Mendes,465.4,154.2,17

In [160]:
#changing the form of columns(insted of space using _)
new_colums=[columns_name.replace(" " , "_") for columns_name in bond.columns]

In [161]:
bond.head()

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Sam Mendes,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Sam Mendes,581.5,145.3,3
Casino Royale,1967,David Niven,Sam Mendes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Sam Mendes,465.4,154.2,17

# query

In [162]:
bond.query('director=="Sean Connery"')

,year,director,actors,box_office,budget,salary
Film,,,,,,
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5,34.7,5
Dr. No,1962,Sean Connery,Sam Mendes,448.8,7.0,0
From Russia with Love,1963,Sean Connery,Sam Mendes,543.8,12.6,1
Goldfinger,1964,Sean Connery,Sam Mendes,820.4,18.6,3
Never Say Never Again,1983,Sean Connery,Sam Mendes,380.0,86.0,6
Thunderball,1965,Sean Connery,Sam Mendes,848.1,41.9,4
You Only Live Twice,1967,Sean Connery,Sam Mendes,514.2,59.9,4

In [164]:
bond.query('director=="Sean Connery" and box_office>500')

,year,director,actors,box_office,budget,salary
Film,,,,,,
From Russia with Love,1963,Sean Connery,Sam Mendes,543.8,12.6,1
Goldfinger,1964,Sean Connery,Sam Mendes,820.4,18.6,3
Thunderball,1965,Sean Connery,Sam Mendes,848.1,41.9,4
You Only Live Twice,1967,Sean Connery,Sam Mendes,514.2,59.9,4

# apply

In [165]:
bond.head()

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Sam Mendes,275.2,54.5,9
Casino Royale,2006,Daniel Craig,Sam Mendes,581.5,145.3,3
Casino Royale,1967,David Niven,Sam Mendes,315.0,85.0,6
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5,34.7,5
Die Another Day,2002,Pierce Brosnan,Sam Mendes,465.4,154.2,17

In [166]:
def add_million(number):
    return str(number)+"million"

In [167]:
#apply  function is applying one function in our columns
bond["box_office"]=bond["box_office"].apply(add_million)

In [168]:
bond.head()

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Sam Mendes,275.2million,54.5,9
Casino Royale,2006,Daniel Craig,Sam Mendes,581.5million,145.3,3
Casino Royale,1967,David Niven,Sam Mendes,315.0million,85.0,6
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5million,34.7,5
Die Another Day,2002,Pierce Brosnan,Sam Mendes,465.4million,154.2,17

In [169]:
cols=["box_office" ,"budget" , "salary"]
for i in cols:
    bond[i]=bond[i].apply(add_million)

In [170]:
bond.head()

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Sam Mendes,275.2millionmillion,54.5million,9million
Casino Royale,2006,Daniel Craig,Sam Mendes,581.5millionmillion,145.3million,3million
Casino Royale,1967,David Niven,Sam Mendes,315.0millionmillion,85.0million,6million
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5millionmillion,34.7million,5million
Die Another Day,2002,Pierce Brosnan,Sam Mendes,465.4millionmillion,154.2million,17million

In [172]:
bond.head()

,year,director,actors,box_office,budget,salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Sam Mendes,275.2millionmillion,54.5million,9million
Casino Royale,2006,Daniel Craig,Sam Mendes,581.5millionmillion,145.3million,3million
Casino Royale,1967,David Niven,Sam Mendes,315.0millionmillion,85.0million,6million
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5millionmillion,34.7million,5million
Die Another Day,2002,Pierce Brosnan,Sam Mendes,465.4millionmillion,154.2million,17million

In [171]:
bond["director"].unique()

['Roger Moore', 'Daniel Craig', 'David Niven', 'Sean Connery', 'Pierce Brosnan', 'Timothy Dalton', 'George Lazenby']
Categories (7, object): ['Daniel Craig', 'David Niven', 'George Lazenby', 'Pierce Brosnan', 'Roger Moore', 'Sean Connery', 'Timothy Dalton']

In [175]:
def quality(row):
    director=row[1]
    budget=row[4]
    
    if director=="Sean Connery":
        return "the best"
    elif director=="Roger Moore" and "Daniel Craig" :
        return "enjoyable"
    else:
        return "i have no idea"

In [178]:
bond["qyaly"]=bond.apply(quality , axis="columns")
bond.head()

,year,director,actors,box_office,budget,salary,qyaly
Film,,,,,,,
A View to a Kill,1985,Roger Moore,Sam Mendes,275.2millionmillion,54.5million,9million,enjoyable
Casino Royale,2006,Daniel Craig,Sam Mendes,581.5millionmillion,145.3million,3million,i have no idea
Casino Royale,1967,David Niven,Sam Mendes,315.0millionmillion,85.0million,6million,i have no idea
Diamonds Are Forever,1971,Sean Connery,Sam Mendes,442.5millionmillion,34.7million,5million,the best
Die Another Day,2002,Pierce Brosnan,Sam Mendes,465.4millionmillion,154.2million,17million,i have no idea